# Intro to Pandas

This is a short introduction to pandas based on the [10 Minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html) geared mainly for new users along with a few addition based on the [Cookbook](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook) recipes

Customarily, we import as follows:

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
%matplotlib inline

## Object Creation

See the [Data Structure Intro section](http://pandas.pydata.org/pandas-docs/stable/dsintro.html#dsintro)

### Series
Creating a Series by passing a list of values, letting pandas create a default integer index:

In [3]:
s = pd.Series([1,3,5,np.nan,6,8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Series is very similar to numpy array but the index of a series is an additional class attribute

In [5]:
s.values # values of the series - a numpy arry

array([ 1.,  3.,  5., nan,  6.,  8.])

In [6]:
s.index # index of the series

RangeIndex(start=0, stop=6, step=1)

### Dataframes

Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:

In [7]:
dates = pd.date_range('20130101', periods=6)

In [8]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

A Dataframe has:
    - index
    - values
    - column names
    - is a generalization of an excel table

In [9]:

df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [10]:
df

                   A         B         C         D
2013-01-01  0.601030 -0.040867  1.880464  1.501975
2013-01-02  0.992919 -0.362450  0.289085 -0.956791
2013-01-03 -0.505067  1.749456 -0.262934  1.042389
2013-01-04  0.836844 -1.313449 -1.342574 -0.132920
2013-01-05 -0.980378 -0.050071  0.766118 -0.762832
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [11]:
df2 = pd.DataFrame({'A':1.,
                   'B':pd.Timestamp('20130102'),
                   'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                   'D':np.array([3]*4,dtype='int32'),
                   'E':pd.Categorical(["test","train","test","train"]),
                   'F':'foo'})

In [12]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Having specific [dtypes](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-dtypes)

In [13]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

If you’re using IPython, tab completion for column names (as well as public attributes) is automatically enabled. Here’s a subset of the attributes that will be completed:

As you can see, the columns A, B, C, and D are automatically tab completed. E is there as well; the rest of the attributes have been truncated for brevity.

## Viewing Data

See the [Basics section](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics)

See the top & bottom rows of the frame

In [14]:
df.head(2)

                   A         B         C         D
2013-01-01  0.601030 -0.040867  1.880464  1.501975
2013-01-02  0.992919 -0.362450  0.289085 -0.956791

In [15]:
df.tail(2)

                   A         B         C         D
2013-01-05 -0.980378 -0.050071  0.766118 -0.762832
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066

Display the index, columns, and the underlying numpy data

In [16]:
df.reset_index().set_index('A').sort_index()

               index         B         C         D
A
-0.980378 2013-01-05 -0.050071  0.766118 -0.762832
-0.513952 2013-01-06 -0.123142  0.748940 -0.175066
-0.505067 2013-01-03  1.749456 -0.262934  1.042389
 0.601030 2013-01-01 -0.040867  1.880464  1.501975
 0.836844 2013-01-04 -1.313449 -1.342574 -0.132920
 0.992919 2013-01-02 -0.362450  0.289085 -0.956791

In [17]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [18]:
df.values

array([[ 0.60102982, -0.04086695,  1.88046356,  1.50197509],
       [ 0.99291905, -0.36244988,  0.2890854 , -0.95679089],
       [-0.50506699,  1.74945625, -0.26293398,  1.04238903],
       [ 0.83684364, -1.31344857, -1.34257359, -0.13291964],
       [-0.98037807, -0.05007062,  0.7661178 , -0.76283223],
       [-0.5139524 , -0.1231418 ,  0.74894025, -0.1750658 ]])

Describe shows a quick statistic summary of the numeric columns of the data

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.071899 -0.023420  0.346517  0.086126
std    0.836277  0.993294  1.088003  0.984243
min   -0.980378 -1.313449 -1.342574 -0.956791
25%   -0.511731 -0.302623 -0.124929 -0.615891
50%    0.047981 -0.086606  0.519013 -0.153993
75%    0.777890 -0.043168  0.761823  0.748562
max    0.992919  1.749456  1.880464  1.501975

Transposing your data

In [20]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.601030    0.992919   -0.505067    0.836844   -0.980378   -0.513952
B   -0.040867   -0.362450    1.749456   -1.313449   -0.050071   -0.123142
C    1.880464    0.289085   -0.262934   -1.342574    0.766118    0.748940
D    1.501975   -0.956791    1.042389   -0.132920   -0.762832   -0.175066

Sorting by an axis

In [21]:
df.reset_index().rename(columns={'index':'date'}).set_index(['date', 'A']).sort_index(axis=0, ascending=True)

                             B         C         D
date       A
2013-01-01  0.601030 -0.040867  1.880464  1.501975
2013-01-02  0.992919 -0.362450  0.289085 -0.956791
2013-01-03 -0.505067  1.749456 -0.262934  1.042389
2013-01-04  0.836844 -1.313449 -1.342574 -0.132920
2013-01-05 -0.980378 -0.050071  0.766118 -0.762832
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066

In [22]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.501975  1.880464 -0.040867  0.601030
2013-01-02 -0.956791  0.289085 -0.362450  0.992919
2013-01-03  1.042389 -0.262934  1.749456 -0.505067
2013-01-04 -0.132920 -1.342574 -1.313449  0.836844
2013-01-05 -0.762832  0.766118 -0.050071 -0.980378
2013-01-06 -0.175066  0.748940 -0.123142 -0.513952

Sorting by value

In [23]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-03 -0.505067  1.749456 -0.262934  1.042389
2013-01-01  0.601030 -0.040867  1.880464  1.501975
2013-01-05 -0.980378 -0.050071  0.766118 -0.762832
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066
2013-01-02  0.992919 -0.362450  0.289085 -0.956791
2013-01-04  0.836844 -1.313449 -1.342574 -0.132920

## Selection

**Note:** While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc, .iloc and .ix.

See the indexing documentation [Indexing and Selecting Data](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing) and [MultiIndex / Advanced Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced)

### Getting

Selecting a single column, which yields a Series, equivalent to df.A

In [24]:
df

                   A         B         C         D
2013-01-01  0.601030 -0.040867  1.880464  1.501975
2013-01-02  0.992919 -0.362450  0.289085 -0.956791
2013-01-03 -0.505067  1.749456 -0.262934  1.042389
2013-01-04  0.836844 -1.313449 -1.342574 -0.132920
2013-01-05 -0.980378 -0.050071  0.766118 -0.762832
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066

In [25]:
df['A']

2013-01-01    0.601030
2013-01-02    0.992919
2013-01-03   -0.505067
2013-01-04    0.836844
2013-01-05   -0.980378
2013-01-06   -0.513952
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows.

In [26]:
df[0:3]

                   A         B         C         D
2013-01-01  0.601030 -0.040867  1.880464  1.501975
2013-01-02  0.992919 -0.362450  0.289085 -0.956791
2013-01-03 -0.505067  1.749456 -0.262934  1.042389

In [27]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.992919 -0.362450  0.289085 -0.956791
2013-01-03 -0.505067  1.749456 -0.262934  1.042389
2013-01-04  0.836844 -1.313449 -1.342574 -0.132920

### Selection by Label

See more in [Selection by Label](Selection by Label)

For getting a cross section using a label

In [28]:
df

                   A         B         C         D
2013-01-01  0.601030 -0.040867  1.880464  1.501975
2013-01-02  0.992919 -0.362450  0.289085 -0.956791
2013-01-03 -0.505067  1.749456 -0.262934  1.042389
2013-01-04  0.836844 -1.313449 -1.342574 -0.132920
2013-01-05 -0.980378 -0.050071  0.766118 -0.762832
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066

In [29]:
df.loc[dates[0]]

A    0.601030
B   -0.040867
C    1.880464
D    1.501975
Name: 2013-01-01 00:00:00, dtype: float64

Selection by Label

In [30]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.601030 -0.040867
2013-01-02  0.992919 -0.362450
2013-01-03 -0.505067  1.749456
2013-01-04  0.836844 -1.313449
2013-01-05 -0.980378 -0.050071
2013-01-06 -0.513952 -0.123142

Showing label slicing, both endpoints are included

In [31]:
df.loc['20130102':'20130104',['A','B']] # 左闭右闭

                   A         B
2013-01-02  0.992919 -0.362450
2013-01-03 -0.505067  1.749456
2013-01-04  0.836844 -1.313449

Reduction in the dimensions of the returned object

In [32]:
df.loc['20130102',['A','B']] = 1

For getting a scalar value

In [33]:
df.loc[dates[0],'A']

0.6010298216722187

In [34]:
df

                   A         B         C         D
2013-01-01  0.601030 -0.040867  1.880464  1.501975
2013-01-02  1.000000  1.000000  0.289085 -0.956791
2013-01-03 -0.505067  1.749456 -0.262934  1.042389
2013-01-04  0.836844 -1.313449 -1.342574 -0.132920
2013-01-05 -0.980378 -0.050071  0.766118 -0.762832
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066

### Selection by Position

See more in [Selection by Position](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-integer)

Select via the position of the passed integers

In [35]:
df

                   A         B         C         D
2013-01-01  0.601030 -0.040867  1.880464  1.501975
2013-01-02  1.000000  1.000000  0.289085 -0.956791
2013-01-03 -0.505067  1.749456 -0.262934  1.042389
2013-01-04  0.836844 -1.313449 -1.342574 -0.132920
2013-01-05 -0.980378 -0.050071  0.766118 -0.762832
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066

In [36]:
df.iloc[3] = 2
df

                   A         B         C         D
2013-01-01  0.601030 -0.040867  1.880464  1.501975
2013-01-02  1.000000  1.000000  0.289085 -0.956791
2013-01-03 -0.505067  1.749456 -0.262934  1.042389
2013-01-04  2.000000  2.000000  2.000000  2.000000
2013-01-05 -0.980378 -0.050071  0.766118 -0.762832
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066

By integer slices, acting similar to numpy/python

In [37]:
df.iloc[3:5,0:2] = 5 # 左闭右开
df

                   A         B         C         D
2013-01-01  0.601030 -0.040867  1.880464  1.501975
2013-01-02  1.000000  1.000000  0.289085 -0.956791
2013-01-03 -0.505067  1.749456 -0.262934  1.042389
2013-01-04  5.000000  5.000000  2.000000  2.000000
2013-01-05  5.000000  5.000000  0.766118 -0.762832
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066

By lists of integer position locations, similar to the numpy/python style

In [38]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.000000  0.289085
2013-01-03 -0.505067 -0.262934
2013-01-05  5.000000  0.766118

For slicing rows explicitly

In [39]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.000000  1.000000  0.289085 -0.956791
2013-01-03 -0.505067  1.749456 -0.262934  1.042389

For slicing columns explicitly

In [40]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.040867  1.880464
2013-01-02  1.000000  0.289085
2013-01-03  1.749456 -0.262934
2013-01-04  5.000000  2.000000
2013-01-05  5.000000  0.766118
2013-01-06 -0.123142  0.748940

For getting a value explicitly

In [41]:
df.iloc[1,1]

1.0

For getting fast access to a scalar (equiv to the prior method)

In [42]:
df.iat[1,1]

1.0

### Multi Indexing

In [46]:
df2.loc[:1,'F'] = 'bar'

C:\Users\22718\AppData\Local\Programs\Python\Python37\lib\site-packages\pandas\core\indexing.py:719: FutureWarning: Slicing a positional slice with .loc is not supported, and will raise TypeError in a future version.  Use .loc with labels or .iloc with positions instead.
  indexer = self._get_setitem_indexer(key)

In [45]:
df2.set_index(['E', 'F'], inplace=True)
df2.sort_index(inplace=True)
df2

KeyError: "None of ['E', 'F'] are in the columns"

### slicing through multi-indexed dataframe

In [47]:
df2.iloc[1:5,:]

             A          B    C  D    F
E     F
test  foo  1.0 2013-01-02  1.0  3  NaN
train bar  1.0 2013-01-02  1.0  3  NaN
      foo  1.0 2013-01-02  1.0  3  NaN

### Using loc on multi-indexed dataframe

In [ ]:
ix = pd.IndexSlice

df2.loc[ix['test',:],:]

## Boolean Indexing

Using a single column’s values to select data.

In [48]:
df

                   A         B         C         D
2013-01-01  0.601030 -0.040867  1.880464  1.501975
2013-01-02  1.000000  1.000000  0.289085 -0.956791
2013-01-03 -0.505067  1.749456 -0.262934  1.042389
2013-01-04  5.000000  5.000000  2.000000  2.000000
2013-01-05  5.000000  5.000000  0.766118 -0.762832
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066

In [49]:
df[df.B > 0]

                   A         B         C         D
2013-01-02  1.000000  1.000000  0.289085 -0.956791
2013-01-03 -0.505067  1.749456 -0.262934  1.042389
2013-01-04  5.000000  5.000000  2.000000  2.000000
2013-01-05  5.000000  5.000000  0.766118 -0.762832

A where operation for getting.

In [50]:
df[df > 0]

                  A         B         C         D
2013-01-01  0.60103       NaN  1.880464  1.501975
2013-01-02  1.00000  1.000000  0.289085       NaN
2013-01-03      NaN  1.749456       NaN  1.042389
2013-01-04  5.00000  5.000000  2.000000  2.000000
2013-01-05  5.00000  5.000000  0.766118       NaN
2013-01-06      NaN       NaN  0.748940       NaN

Using the isin() method for filtering:

In [51]:
df2 = df.copy()

In [52]:
df2['E'] = ['one','one', 'two','three','four','three']

In [53]:
df2

                   A         B         C         D      E
2013-01-01  0.601030 -0.040867  1.880464  1.501975    one
2013-01-02  1.000000  1.000000  0.289085 -0.956791    one
2013-01-03 -0.505067  1.749456 -0.262934  1.042389    two
2013-01-04  5.000000  5.000000  2.000000  2.000000  three
2013-01-05  5.000000  5.000000  0.766118 -0.762832   four
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066  three

In [54]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.505067  1.749456 -0.262934  1.042389   two
2013-01-05  5.000000  5.000000  0.766118 -0.762832  four

## Setting

Setting a new column automatically aligns the data by the indexes

In [55]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102',periods=6))

In [56]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [58]:
df['F'] = s1
df

                   A         B         C         D    F
2013-01-01  0.601030 -0.040867  1.880464  1.501975  NaN
2013-01-02  1.000000  1.000000  0.289085 -0.956791  1.0
2013-01-03 -0.505067  1.749456 -0.262934  1.042389  2.0
2013-01-04  5.000000  5.000000  2.000000  2.000000  3.0
2013-01-05  5.000000  5.000000  0.766118 -0.762832  4.0
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066  5.0

Setting values by label

In [60]:
df.at[dates[0],'A'] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.040867  1.880464  1.501975  NaN
2013-01-02  1.000000  1.000000  0.289085 -0.956791  1.0
2013-01-03 -0.505067  1.749456 -0.262934  1.042389  2.0
2013-01-04  5.000000  5.000000  2.000000  2.000000  3.0
2013-01-05  5.000000  5.000000  0.766118 -0.762832  4.0
2013-01-06 -0.513952 -0.123142  0.748940 -0.175066  5.0

Settomg values by position

In [61]:
df.iat[0,1] = 0

Setting by assigning with a numpy array

In [63]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.880464  5  NaN
2013-01-02  1.000000  1.000000  0.289085  5  1.0
2013-01-03 -0.505067  1.749456 -0.262934  5  2.0
2013-01-04  5.000000  5.000000  2.000000  5  3.0
2013-01-05  5.000000  5.000000  0.766118  5  4.0
2013-01-06 -0.513952 -0.123142  0.748940  5  5.0

The result of the prior setting operations

In [ ]:
df

A where operation with setting.

In [ ]:
df2 = df.copy()

In [ ]:
df2[df2 > 0] = -df2

In [ ]:
df2

## Missing Data

pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. See the Missing Data section

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [ ]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [ ]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [ ]:
df1

To drop any rows that have missing data.

In [ ]:
df1.dropna(how='all', axis=1)

Filling missing data

In [ ]:
df1.fillna(value=5)

To get the boolean mask where values are nan

In [ ]:
pd.isnull(df1).sum()

## Operations

See the [Basic section on Binary Ops](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-binop)

In [ ]:
df

### Stats

Operations in general exclude missing data.

Performing a descriptive statistic

In [ ]:
df.max()

Same operation on the other axis

In [ ]:
df.mean(1)

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [ ]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates)#.shift(2)

In [ ]:
s

In [ ]:
s

In [ ]:
df.subtract(s, axis='index')

In [ ]:
df.sub(s, axis='index')

### Apply

Applying functions to the data

In [64]:
df.cumsum()

                    A          B         C   D     F
2013-01-01   0.000000   0.000000  1.880464   5   NaN
2013-01-02   1.000000   1.000000  2.169549  10   1.0
2013-01-03   0.494933   2.749456  1.906615  15   3.0
2013-01-04   5.494933   7.749456  3.906615  20   6.0
2013-01-05  10.494933  12.749456  4.672733  25  10.0
2013-01-06   9.980981  12.626314  5.421673  30  15.0

In [65]:
df.apply(np.cumsum)

                    A          B         C   D     F
2013-01-01   0.000000   0.000000  1.880464   5   NaN
2013-01-02   1.000000   1.000000  2.169549  10   1.0
2013-01-03   0.494933   2.749456  1.906615  15   3.0
2013-01-04   5.494933   7.749456  3.906615  20   6.0
2013-01-05  10.494933  12.749456  4.672733  25  10.0
2013-01-06   9.980981  12.626314  5.421673  30  15.0

In [66]:
df.apply(lambda x: x.max() - x.min())

A    5.513952
B    5.123142
C    2.262934
D    0.000000
F    4.000000
dtype: float64

### Histogramming

See more at [Histogramming and Discretization](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-discretization)

In [67]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [68]:
s

0    5
1    0
2    3
3    5
4    1
5    2
6    5
7    4
8    0
9    3
dtype: int32

In [69]:
s.value_counts()

5    3
0    2
3    2
1    1
2    1
4    1
dtype: int64

### String Methods

Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses [regular expressions](https://docs.python.org/2/library/re.html) by default (and in some cases always uses them). See more at [Vectorized String Methods](http://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods).

In [70]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [71]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [72]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge

### Concat

pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

See the [Merging section](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging)

Concatenating pandas objects together with concat():

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4))

In [ ]:
df

In [ ]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

In [ ]:
pd.concat(pieces)

### Join

SQL style merges. See the [Database style joining](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join)

In [ ]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [ ]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [ ]:
left

In [ ]:
right

In [ ]:
pd.merge(left, right, on='key')

### Append

Append rows to a dataframe. See the [Appending](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation)

In [ ]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [ ]:
df

In [ ]:
s = df.iloc[3]
s

In [ ]:
df.append(s, ignore_index=True)

## Grouping

By “group by” we are referring to a process involving one or more of the following steps

* **Splitting** the data into groups based on some criteria
* **Applying** a function to each group independently
* **Combining** the results into a data structure

See the [Grouping section](http://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby)

In [ ]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
                                    'B' : ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                                    'C' : np.random.randn(8),
                                     'D' : np.random.randn(8)})

In [ ]:
df.set_index(['A', 'B']).sort_index()

Grouping and then applying a function sum to the resulting groups.

In [ ]:
df.groupby(['A', 'B']).max()

In [ ]:
df.groupby('A').sum()

In [ ]:
df.groupby(['A','B']).sum()

In [ ]:
df.set_index(['A', 'B']).sort_index()

In [ ]:
df.groupby(['A', 'B']).describe()

## Reshaping

See the sections on [Hierarchical Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced-hierarchical) and [Reshaping](http://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-stacking).

### Stack

In [73]:
tuples = list(zip(
    *[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
      ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [74]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [75]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one     0.513516 -0.769791
      two    -0.201624  0.395715
baz   one    -1.906061 -2.022291
      two    -1.922579  0.545242
foo   one    -0.816122  0.304913
      two    -0.452542 -0.689828
qux   one    -1.156998  0.530475
      two     1.026624  0.668696

In [76]:
df2 = df[:4]

In [77]:
df2

                     A         B
first second
bar   one     0.513516 -0.769791
      two    -0.201624  0.395715
baz   one    -1.906061 -2.022291
      two    -1.922579  0.545242

The stack() method “compresses” a level in the DataFrame’s columns.

In [78]:
stacked = df2.stack()

In [79]:
stacked

first  second
bar    one     A    0.513516
               B   -0.769791
       two     A   -0.201624
               B    0.395715
baz    one     A   -1.906061
               B   -2.022291
       two     A   -1.922579
               B    0.545242
dtype: float64

With a “stacked” DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the **last level**:

In [80]:
stacked.unstack()

                     A         B
first second
bar   one     0.513516 -0.769791
      two    -0.201624  0.395715
baz   one    -1.906061 -2.022291
      two    -1.922579  0.545242

In [81]:
stacked.unstack(1)

second        one       two
first
bar   A  0.513516 -0.201624
      B -0.769791  0.395715
baz   A -1.906061 -1.922579
      B -2.022291  0.545242

In [82]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.513516 -1.906061
       B -0.769791 -2.022291
two    A -0.201624 -1.922579
       B  0.395715  0.545242

### Pivot Tables

See the section on [Pivot Tables](http://pandas.pydata.org/pandas-docs/stable/reshaping.html#reshaping-pivot).

In [ ]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                                    'B' : ['A', 'B', 'C'] * 4,
                                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                                    'D' : np.random.randn(12),
                                    'E' : np.random.randn(12)})

In [ ]:
df

We can produce pivot tables from this data very easily:

In [ ]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

## Time Series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications. See the [Time Series section](http://pandas.pydata.org/pandas-docs/stable/timeseries.html#timeseries)

In [ ]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')
rng

In [ ]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

In [ ]:
ts.resample?

In [ ]:
ts.resample('1Min').sum()

Time zone representation

In [ ]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [ ]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [ ]:
ts

In [ ]:
ts_utc = ts.tz_localize('UTC')

In [ ]:
ts_utc


Convert to another time zone

In [ ]:
ts_utc.tz_convert('US/Eastern')


Converting between time span representations

In [ ]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [ ]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [ ]:
ts

In [ ]:
ps = ts.to_period()

In [ ]:
ps

In [ ]:
ps.to_timestamp()

Converting between period and timestamp enables some convenient arithmetic functions to be used. In the following example, we convert a quarterly frequency with year ending in November to 9am of the end of the month following the quarter end:

In [ ]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
prng

In [ ]:
ts = pd.Series(np.random.randn(len(prng)), prng)
ts

In [ ]:
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

In [ ]:
ts.head()

## Categoricals

Since version 0.15, pandas can include categorical data in a DataFrame. For full docs, see the [categorical introduction](http://pandas.pydata.org/pandas-docs/stable/categorical.html#categorical) and the [API documentation](http://pandas.pydata.org/pandas-docs/stable/api.html#api-categorical).

In [ ]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

Convert the raw grades to a categorical data type.

In [ ]:
df["grade"] = df["raw_grade"].astype("category")

In [ ]:
df["grade"]

Rename the categories to more meaningful names (assigning to Series.cat.categories is inplace!)

In [ ]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

Reorder the categories and simultaneously add the missing categories (methods under Series .cat return a new Series per default).

In [ ]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [ ]:
df["grade"]

Sorting is per order in the categories, not lexical order.

In [ ]:
df.sort_values(by="grade")

Grouping by a categorical column shows also empty categories.

In [ ]:
df.groupby("grade").size()

## Plotting
[Plotting](http://pandas.pydata.org/pandas-docs/stable/visualization.html#visualization) docs.

In [ ]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))

In [ ]:
ts = ts.cumsum()

In [ ]:
ts.plot()

On DataFrame, plot() is a convenience to plot all of the columns with labels:

In [ ]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index,
                  columns=['A', 'B', 'C', 'D'])

In [ ]:
df = df.cumsum()

In [ ]:
plt.figure(); df.plot(); plt.legend(loc='best')

## Getting Data In/Out

### CSV
[Writing to a csv file](http://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv)

In [ ]:
df.to_csv('foo.csv')

[Reading from a csv file](http://pandas.pydata.org/pandas-docs/stable/io.html#io-read-csv-table)

In [ ]:
pd.read_csv('foo.csv')

#### Reading large CSV files

In [ ]:
iterator = pd.read_csv('foo.csv', iterator=True, chunksize=3)
iterator

In [ ]:
iterator.get_chunk()

### HDF5
Reading and writing to [HDFStores](http://pandas.pydata.org/pandas-docs/stable/io.html#io-hdf5)

Writing to a HDF5 Store

In [ ]:
df.to_hdf('foo.h5','df')

Reading from a HDF5 Store

In [ ]:
pd.read_hdf('foo.h5','df')

### Excel

Reading and writing to [MS Excel](http://pandas.pydata.org/pandas-docs/stable/io.html#io-excel)

Writing to an excel file

In [ ]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

Reading from an excel file

In [ ]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

### Gotchas
If you are trying an operation and you see an exception like:

In [ ]:
if pd.Series([False, True, False]):
    print("I was true")

See [Comparisons](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-compare) for an explanation and what to do.

See [Gotchas](http://pandas.pydata.org/pandas-docs/stable/gotchas.html#gotchas) as well.